[
  {
    "plantId": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant, also known as Sansevieria, is a hardy and versatile indoor plant celebrated for its ability to thrive in low-light conditions and its minimal maintenance requirements. Its upright, sword-like leaves add a modern architectural element to any room, while simultaneously purifying the air by removing toxins such as formaldehyde and benzene. Perfect for bedrooms, living rooms, offices, or any indoor space, the Snake Plant can tolerate occasional neglect, making it ideal for beginners and busy plant owners. Its resilience, air-purifying qualities, and striking appearance make it a must-have for anyone looking to enhance indoor air quality while adding a touch of greenery.",
    "image": "https://i.ibb.co.com/QvYZJMRH/Screenshot-2025-10-22-114606.png",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 2,
    "plantName": "Peace Lily",
    "category": "Flowering",
    "price": 22,
    "rating": 4.6,
    "availableStock": 8,
    "careLevel": "Medium",
    "description": "The Peace Lily (Spathiphyllum) is a sophisticated indoor plant admired for its glossy, deep green leaves and elegant white blooms. It thrives in indirect light and requires moderate watering, making it suitable for homes and offices. This plant excels at improving indoor air quality by filtering out common airborne toxins. Its lush foliage and delicate flowers provide a calming aesthetic, adding a touch of serenity and sophistication to your environment. With its low-maintenance care routine and striking presence, the Peace Lily is ideal for plant enthusiasts seeking both beauty and functionality in their indoor greenery.",
    "image": "https://i.ibb.co.com/p8VZfJc/Screenshot-2025-10-22-114703.png",
    "providerName": "NatureNest"
  },
  {
    "plantId": 3,
    "plantName": "Aloe Vera",
    "category": "Succulent",
    "price": 15,
    "rating": 4.9,
    "availableStock": 12,
    "careLevel": "Easy",
    "description": "Aloe Vera is a renowned succulent prized for its medicinal properties, aesthetic appeal, and effortless care. Its thick, fleshy leaves store water, enabling it to thrive in arid conditions and survive occasional neglect. Aloe Vera gel, derived from the leaves, is celebrated for its skin-soothing, moisturizing, and healing properties, making it a practical addition to any home. Ideal for bright, indirect sunlight, it fits perfectly in kitchens, living areas, or offices. With minimal watering needs and a natural air-purifying effect, Aloe Vera offers both functional benefits and a striking visual element for any indoor space.",
    "image": "https://i.ibb.co.com/vC13qjmY/Screenshot-2025-10-22-114747.png",
    "providerName": "GreenLeaf Garden"
  },
  {
    "plantId": 4,
    "plantName": "ZZ Plant",
    "category": "Air Purifier",
    "price": 25,
    "rating": 4.7,
    "availableStock": 9,
    "careLevel": "Easy",
    "description": "The ZZ Plant (Zamioculcas zamiifolia) is a resilient and visually striking indoor plant known for its glossy, waxy leaves and ability to thrive in low-light conditions. Perfect for busy homeowners or office spaces, the ZZ Plant requires minimal attention and can tolerate occasional neglect. Its thick stems store water efficiently, while its elegant dark green leaves add a contemporary aesthetic to interiors. In addition to its ornamental appeal, the ZZ Plant is excellent at purifying indoor air and removing toxins, contributing to a healthier environment. Long-lasting and pest-resistant, this plant is a perfect combination of beauty, practicality, and sustainability for any indoor space.",
    "image": "https://i.ibb.co.com/MDXbGXz1/Screenshot-2025-10-22-114719.png",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 5,
    "plantName": "Spider Plant",
    "category": "Hanging",
    "price": 16,
    "rating": 4.5,
    "availableStock": 14,
    "careLevel": "Easy",
    "description": "The Spider Plant (Chlorophytum comosum) is a popular indoor plant recognized for its arching green leaves with elegant white stripes and its ability to produce small 'spiderettes' that can be easily propagated. It thrives in indirect sunlight and is excellent at filtering indoor air pollutants. Its cascading foliage makes it ideal for hanging baskets, shelves, or tabletops, adding vitality and movement to indoor spaces. Extremely resilient and low-maintenance, the Spider Plant is perfect for beginners, children, or anyone looking for a lively and decorative indoor plant that promotes air quality and natural beauty.",
    "image": "https://i.ibb.co.com/396mRQHq/Screenshot-2025-10-22-114853.png",
    "providerName": "LeafyWorld"
  },
  {
    "plantId": 6,
    "plantName": "Rubber Plant",
    "category": "Foliage",
    "price": 28,
    "rating": 4.9,
    "availableStock": 6,
    "careLevel": "Medium",
    "description": "The Rubber Plant (Ficus elastica) is a bold indoor plant admired for its large, glossy, dark green leaves and tropical appeal. It thrives in bright, indirect light and tolerates moderate shade. This plant improves air quality by removing toxins while adding a dramatic architectural presence to any room. With moderate care and occasional watering, the Rubber Plant grows into an impressive statement piece suitable for living rooms, offices, and open indoor spaces. Its elegant foliage, low-maintenance requirements, and long-lasting growth make it an essential choice for indoor greenery enthusiasts seeking both style and functionality.",
    "image": "https://i.ibb.co.com/pv25kkqh/Screenshot-2025-10-22-114926.png",
    "providerName": "EcoRoots"
  },
  {
    "plantId": 7,
    "plantName": "Monstera Deliciosa",
    "category": "Foliage",
    "price": 32,
    "rating": 4.8,
    "availableStock": 7,
    "careLevel": "Medium",
    "description": "Monstera Deliciosa, or the Swiss Cheese Plant, is a stunning indoor plant known for its large, perforated leaves and bold tropical aesthetic. It thrives in bright, indirect light and moderate watering, making it ideal for homes and offices seeking statement foliage. This plant adds an exotic and contemporary vibe to interiors while improving air quality. Its climbing habit and unique leaf patterns make it a favorite among plant enthusiasts and interior designers. Monstera Deliciosa combines elegance, scale, and resilience, perfect for creating a dramatic focal point in any indoor space.",
    "image": "https://i.ibb.co.com/PsN2s1dh/Screenshot-2025-10-22-191342.png",
    "providerName": "TropicalBloom"
  },
  {
    "plantId": 8,
    "plantName": "Lucky Bamboo",
    "category": "Decorative",
    "price": 20,
    "rating": 4.6,
    "availableStock": 11,
    "careLevel": "Easy",
    "description": "Lucky Bamboo (Dracaena sanderiana) is a popular decorative plant associated with prosperity, positive energy, and indoor tranquility. It thrives in water or soil, prefers low to medium indirect light, and requires minimal care. Its slender green stalks, often arranged in aesthetically pleasing formations, make it a striking addition to desks, shelves, and tabletop displays. Easy to maintain and highly symbolic, Lucky Bamboo not only enhances the visual appeal of indoor spaces but also brings a sense of harmony and good fortune. Ideal for beginners, office spaces, or anyone seeking an attractive and meaningful indoor plant.",
    "image": "https://i.ibb.co.com/TMNsXkRN/Screenshot-2025-10-22-191401.png",
    "providerName": "ZenLeaf Studio"
  }
]
